Autodesk.Revit.DB.Analysis.AnalysisMode
This enum is used to define the Energy Analysis Model.
Since:
2016

Autodesk.Revit.DB.Analysis.AnalysisMode.ConceptualMassesAndBuildingElements
Energy Analysis Model based on conceptual masses and building elements.

Autodesk.Revit.DB.Analysis.AnalysisMode.ConceptualMasses
Energy Analysis Model based on conceptual masses.

Autodesk.Revit.DB.Analysis.AnalysisMode.BuildingElements
Energy Analysis Model based on building elements.